---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblemClosedArcOrEllipse
source: html/903174dc-a936-f665-980c-b8bcca410ae5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplitManagerProblemClosedArcOrEllipse Property

Divided Surface cannot be split by a closed arc or ellipse.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSplitManagerProblemClosedArcOrEllipse { get; }
```